arkadiuszmakarenko/ch32fun/examples_v20x/usbhost_hid/usbhost_hid.c
// usbhost_hid.c
//
// USB HID class driver for the ch32fun USB host stack.
//
// Walks the configuration descriptor looking for an interface that is
// either:
//   - a boot-protocol HID (class=3, subclass=1, protocol=1 keyboard
//     or 2 mouse) — we issue SET_PROTOCOL boot, the boot report has a
//     fixed layout, and the caller's report buffer is treated as a
//     USBH_HidKbdReport or USBH_HidMouseReport, OR
//   - a report-protocol HID (class=3, any other subclass/protocol),
//     or a vendor-specific Xbox-360 interface (class=0xFF, subclass=
//     0x5D, protocol=0x01) — we leave the device on report protocol
//     and parse its HID Report Descriptor to learn the layout of
//     axes, buttons, and wheel.
//
// The Xbox 360 wired controller is special-cased: it has no HID
// Report Descriptor and uses a fixed 20-byte input report with
// header 0x00 0x14. We detect it by VID/PID (Microsoft 0x045E/0x028E)
// or by the vendor interface descriptor, and the caller's buffer
// is filled with raw bytes for the Xbox 360 decoder to consume.

#include "ch32fun.h"
#include <stdio.h>
#include <string.h>
#include "usbhost_hw.h"
#include "usbhost_xfer.h"
#include "usbhost_std.h"
#include "usbhost_defs.h"
#include "usbhost_hid.h"

// Class / subclass / protocol values we care about.
#define USBH_HID_CLASS             0x03u
#define USBH_HID_SUBCLASS_BOOTIF   0x01u
#define USBH_HID_PROTOCOL_KBD      0x01u
#define USBH_HID_PROTOCOL_MOUSE    0x02u

// Xbox 360 wired controller — vendor-specific interface.
#define USBH_X360_ITF_CLASS        0xFFu
#define USBH_X360_ITF_SUBCLASS     0x5Du
#define USBH_X360_ITF_PROTOCOL     0x01u
#define USBH_X360_VID              0x045Eu
#define USBH_X360_PID              0x028Eu

// Class requests.
#define USBH_HID_REQ_GET_REPORT    0x01u
#define USBH_HID_REQ_SET_IDLE      0x0Au
#define USBH_HID_REQ_SET_PROTOCOL  0x0Bu
#define USBH_HID_PROTOCOL_BOOT     0x00u
#define USBH_HID_PROTOCOL_REPORT   0x01u

// Endpoint types.
#define USBH_HID_EP_TYPE_INTR      0x03u

// Sizes.
#define USBH_HID_REP_DESC_MAX      256u   // generous for mice / pads
#define USBH_HID_REP_LEN_BOOT_KBD  8u
#define USBH_HID_REP_LEN_BOOT_MSE  3u
#define USBH_HID_REP_LEN_XBOX360   20u


// ---------------------------------------------------------------------------
// USBH_Put16_inline
// ---------------------------------------------------------------------------
static inline void USBH_Put16_inline( uint8_t *p, uint16_t v )
{
	p[0] = (uint8_t)( v       & 0xFFu );
	p[1] = (uint8_t)( (v >> 8) & 0xFFu );
}


// ---------------------------------------------------------------------------
// Class-specific request helper (SET_IDLE / SET_PROTOCOL).
// ---------------------------------------------------------------------------
static uint8_t USBH_HidClassReq( uint8_t ep0_size, uint8_t iface,
	uint8_t request, uint16_t wvalue )
{
	USBH_SetupReq req;
	uint16_t got = 0;
	uint8_t  s;

	req.bmRequestType = 0x21u;  // host-to-device, class, interface
	req.bRequest = request;
	USBH_Put16_inline( (uint8_t*)&req.wValue, wvalue );
	USBH_Put16_inline( (uint8_t*)&req.wIndex, iface );
	USBH_Put16_inline( (uint8_t*)&req.wLength, 0 );

	s = USBH_CtrlXfer( &req, NULL, 0, ep0_size, &got );
	return s;
}


// ---------------------------------------------------------------------------
// Scan the config descriptor for the first matching interface. Returns
// the interface number via *piface, the interrupt-IN endpoint
// details via *pin_ep/*pin_maxp/*pin_interval, the *report length*
// (used only for boot-protocol devices) via *prep_len, and the
// *HID Report Descriptor length* (from the class-specific HID
// descriptor) via *prep_desc_len.
//
// `*pkbd_proto` is filled with 1 for keyboard, 2 for mouse, 0 for
// other (gamepad, multi-button mouse, etc), 0xFF for Xbox 360.
//
// Boot-protocol devices: bInterfaceSubClass=1, bInterfaceProtocol=1 or 2.
// Xbox 360:             bInterfaceClass=0xFF, bInterfaceSubClass=0x5D,
//                       bInterfaceProtocol=0x01.
// Other HID:            bInterfaceClass=3.
// ---------------------------------------------------------------------------
static uint8_t USBH_FindHid( const uint8_t *cfg, uint16_t total,
	const uint8_t *dev_desc,
	uint8_t *piface,
	uint8_t *pkbd_proto,
	uint8_t *pin_ep,
	uint16_t *pin_maxp,
	uint8_t *pin_interval,
	uint8_t *prep_len,
	uint16_t *prep_desc_len )
{
	uint16_t off = 0;
	uint8_t  match_iface = 0xFF;
	uint8_t  match_proto = 0xFFu;
	uint8_t  match_ep    = 0;
	uint16_t match_maxp  = 0;
	uint8_t  match_intv  = 0;
	uint8_t  match_rlen  = 0;
	uint16_t match_dlen  = 0;

	// For Xbox 360 detection we need the device VID/PID; the device
	// descriptor is 18 bytes and the IDs are at bytes 8..11.
	uint16_t vid = 0, pid = 0;
	if( dev_desc )
	{
		vid = (uint16_t)dev_desc[8]  | ( (uint16_t)dev_desc[9]  << 8 );
		pid = (uint16_t)dev_desc[10] | ( (uint16_t)dev_desc[11] << 8 );
	}

	while( off + 2 <= total )
	{
		uint8_t len  = cfg[off];
		uint8_t type = cfg[off + 1];
		if( len == 0 ) break;
		if( off + len > total ) break;

		if( type == USBH_DESC_INTERFACE && len >= 9 )
		{
			uint8_t cls   = cfg[off + 5];
			uint8_t sub   = cfg[off + 6];
			uint8_t proto = cfg[off + 7];

			// First match wins. We prefer boot-protocol devices if
			// both are present, since they're the most common.
			if( match_iface == 0xFF )
			{
				if( cls == USBH_HID_CLASS &&
				    sub == USBH_HID_SUBCLASS_BOOTIF &&
				    ( proto == USBH_HID_PROTOCOL_KBD ||
				      proto == USBH_HID_PROTOCOL_MOUSE ) )
				{
					match_iface = cfg[off + 2];
					match_proto = proto;
					match_rlen  = ( proto == USBH_HID_PROTOCOL_KBD )
					             ? USBH_HID_REP_LEN_BOOT_KBD
					             : USBH_HID_REP_LEN_BOOT_MSE;
				}
				else if( ( vid == USBH_X360_VID && pid == USBH_X360_PID ) ||
				         ( cls == USBH_X360_ITF_CLASS &&
				           sub == USBH_X360_ITF_SUBCLASS &&
				           proto == USBH_X360_ITF_PROTOCOL ) )
				{
					// Xbox 360 — the actual IN endpoint will be
					// picked up below; it lives in the same
					// interface descriptor's EP list.
					match_iface = cfg[off + 2];
					match_proto = 0xFEu;  // sentinel for X360
					match_rlen  = USBH_HID_REP_LEN_XBOX360;
				}
				else if( cls == USBH_HID_CLASS )
				{
					// Generic HID (gamepad, multi-button mouse,
					// consumer control, etc). We accept the
					// first one — the parser then decides if it
					// has axes / buttons / wheel.
					match_iface = cfg[off + 2];
					match_proto = 0x00u;  // report-protocol HID
					match_rlen  = 0;       // filled in by parser
				}
			}
		}
		else if( type == USBH_DESC_ENDPOINT && len >= 7 &&
		         match_iface != 0xFF )
		{
			// Endpoints follow the interface they belong to, until
			// the next interface descriptor. We only collect EPs
			// while we're still inside the matched interface.
			// Simpler approach: collect every interrupt-IN EP and
			// keep the first one (we match on iface afterwards).
			uint8_t eaddr = cfg[off + 2];
			uint8_t eattr = cfg[off + 3];
			uint16_t emaxp = (uint16_t)cfg[off + 4] | ((uint16_t)cfg[off + 5] << 8);
			uint8_t eintv = cfg[off + 6];
			if( ( eaddr & 0x80 ) &&                 // IN
			    ( eattr & 0x03 ) == USBH_HID_EP_TYPE_INTR &&
			    match_ep == 0 )
			{
				match_ep   = eaddr & 0x0Fu;
				match_maxp = emaxp;
				match_intv = eintv;
			}
		}
		else if( type == USBH_DESC_HID && len >= 6 && match_iface != 0xFF )
		{
			// The HID class descriptor's wReportDescriptorLength is
			// at offsets 4..5 of the descriptor (after bcdHID,
			// bCountryCode, bNumDescriptors).
			match_dlen = (uint16_t)cfg[off + 4] | ((uint16_t)cfg[off + 5] << 8);
		}

		off += len;
	}

	if( match_iface == 0xFF || match_ep == 0 ) {
		return USBH_ERR_USB_HID_NOBOOT;
	}

	*piface        = match_iface;
	*pkbd_proto    = match_proto;
	*pin_ep        = match_ep;
	*pin_maxp      = match_maxp;
	*pin_interval  = match_intv;
	*prep_len      = match_rlen;
	*prep_desc_len = match_dlen;
	printf( "HID: find iface=%u proto=%02x ep=0x%02x maxp=%u dlen=%u rlen=%u\n",
		match_iface, match_proto, match_ep, match_maxp, match_dlen, match_rlen );
	return USBH_ERR_SUCCESS;
}


// ---------------------------------------------------------------------------
// USBH_HidInit
//
// Bring up the first matching HID interface. See the header for the
// return-value contract.
// ---------------------------------------------------------------------------
uint8_t USBH_HidInit( const uint8_t *dev_desc,
                      const uint8_t *cfg_desc, uint16_t cfg_len,
                      uint8_t *pkind,
                      uint8_t *prep_len,
                      uint8_t *pin_ep,
                      uint16_t *pin_maxp,
                      uint8_t *pin_interval,
                      hid_report_t *pdesc )
{
	uint8_t  s;
	uint8_t  iface = 0;
	uint8_t  proto = 0xFFu;
	uint8_t  ep = 0;
	uint16_t maxp = 0;
	uint8_t  interval = 0;
	uint8_t  rlen = 0;
	uint16_t dlen = 0;
	uint8_t  kind = USBH_HID_KIND_NONE;
	uint8_t  rep_desc[ USBH_HID_REP_DESC_MAX ];

	if( pdesc ) memset( pdesc, 0, sizeof( *pdesc ) );

