arkadiuszmakarenko/ch32fun/examples_v20x/usbhost_hid/usbhost_hid.c
	// Use the device's actual bMaxPacketSize0 (from byte 7 of the
	// device descriptor) for control transfers — many low-speed
	// mice only have 8 bytes of EP0 FIFO, and using a larger value
	// will make USBH_CtrlXfer's short-packet check misfire after
	// the first 8-byte chunk. Default to 8 (the minimum) if the
	// descriptor is missing or zero.
	uint8_t ep0_size = 8;
	if( dev_desc && dev_desc[0] >= 8 )
	{
		ep0_size = dev_desc[7];
		if( ep0_size == 0 ) ep0_size = 8;
	}

	s = USBH_FindHid( cfg_desc, cfg_len, dev_desc,
		&iface, &proto, &ep, &maxp, &interval, &rlen, &dlen );
	if( s != USBH_ERR_SUCCESS )
	{
		printf( "HID: scan failed\n" );
		return s;
	}
	printf( "HID: ep0_size=%u (from bMaxPacketSize0)\n", ep0_size );

	if( proto == 0xFEu )
	{
		// Xbox 360 wired controller. No class setup needed; just
		// remember the layout and hand back a fixed-size buffer.
		kind = USBH_HID_KIND_XBOX360;
		rlen = USBH_HID_REP_LEN_XBOX360;
		printf( "HID: Xbox 360 iface #%u, ep=0x%02x maxp=%u interval=%u\n",
			iface, ep, maxp, interval );
	}
	else
	{
		// SET_IDLE 0 — wake on every report (and the device can
		// stay silent when nothing's happening).
		s = USBH_HidClassReq( ep0_size, iface,
			USBH_HID_REQ_SET_IDLE, 0x0000u );
		if( s != USBH_ERR_SUCCESS )
		{
			printf( "HID: SET_IDLE failed %02x\n", s );
			return s;
		}

		if( proto == USBH_HID_PROTOCOL_KBD || proto == USBH_HID_PROTOCOL_MOUSE )
		{
			// Boot-capable interface. We prefer *report* protocol
			// even for these — many mice that advertise boot
			// subclass still expose a wheel / extra buttons in
			// their HID Report Descriptor, but boot protocol
			// itself is a fixed 3-byte report (buttons/X/Y) with
			// no room for the wheel. So:
			//
			//   1. Stay on report protocol (the default after
			//      SET_CONFIGURATION). SET_PROTOCOL is a no-op
			//      until we explicitly issue it.
			//   2. Fetch the HID Report Descriptor and parse it.
			//   3. If we get a usable mouse / keyboard layout
			//      (with or without a wheel), use report protocol.
			//   4. Only fall back to boot protocol if the device
			//      has no HID Report Descriptor at all (very old
			//      mice, or the GET_DESCRIPTOR request STALLs).
			kind = ( proto == USBH_HID_PROTOCOL_KBD )
			     ? USBH_HID_KIND_KEYBOARD
			     : USBH_HID_KIND_MOUSE;

			printf( "HID: boot-cap iface=%u, wReportDescriptorLength=%u\n",
				iface, dlen );

			int used_report_proto = 0;
			if( dlen > 0 && dlen <= USBH_HID_REP_DESC_MAX )
			{
				uint16_t want = dlen;
				s = USBH_GetHidReportDesc( ep0_size, iface,
					rep_desc, &want );
				printf( "HID: GET_REPORT_DESC rc=%02x got=%u\n",
					s, want );
				if( s == USBH_ERR_SUCCESS && want > 0 )
				{
					// Hex-dump the first 64 bytes of the
					// report descriptor. With 32-byte
					// chunks, the first dump is enough to
					// see the report ID, usages, etc.
					printf( "HID: report desc:" );
					for( uint16_t k = 0; k < want && k < 96; k++ )
					{
						if( ( k & 15 ) == 0 ) printf( "\n  %04x:", k );
						printf( " %02x", rep_desc[ k ] );
					}
					printf( "\n" );

					if( pdesc )
					{
						int pr = parse_report_descriptor( rep_desc, want, pdesc );
						if( !pr )
						{
							uint16_t ooff = 0;
							uint16_t oerr = usbhost_reportparser_last_err( &ooff );
							printf( "HID: parser FAILED err=%04x off=%u type=%u rlen=%u btns=%u\n",
								oerr, ooff, pdesc->type, pdesc->report_size,
								pdesc->button_count );
						}
						else
						{
							printf( "HID: parser rc=%d type=%u rlen=%u btns=%u "
								"rid=%u X(%u/%u) Y(%u/%u) W(%u/%u) hat=(%u/%u)\n",
								pr, pdesc->type, pdesc->report_size,
								pdesc->button_count, pdesc->report_id,
								pdesc->axis[0].size, pdesc->axis[0].logical.min,
								pdesc->axis[1].size, pdesc->axis[1].logical.min,
								pdesc->wheel.size,  pdesc->wheel.logical.min,
								pdesc->hat.size,    pdesc->hat.logical.min );
						}
						if( pr )
						{
							used_report_proto = 1;
							if( pdesc->type == USBH_REPORT_TYPE_MOUSE )
							{
								kind = USBH_HID_KIND_MOUSE;
								rlen = pdesc->report_size;
							}
							else if( pdesc->type == USBH_REPORT_TYPE_JOYSTICK )
							{
								kind = USBH_HID_KIND_GAMEPAD;
								rlen = pdesc->report_size;
							}
							else if( pdesc->type == USBH_REPORT_TYPE_KEYBOARD )
							{
								kind = USBH_HID_KIND_KEYBOARD;
								rlen = pdesc->report_size;
							}
							else
							{
								// Parser succeeded but didn't
								// recognise a usage we know
								// about. Fall through to boot.
								used_report_proto = 0;
							}
						}
					}
				}
			}
			else
			{
				printf( "HID: no HID class descriptor in cfg (dlen=%u)\n", dlen );
			}

			if( !used_report_proto )
			{
				// Either no report descriptor at all, or the
				// parser bailed. Issue SET_PROTOCOL boot so the
				// device sends the standard 3- or 8-byte report.
				s = USBH_HidClassReq( ep0_size, iface,
					USBH_HID_REQ_SET_PROTOCOL,
					USBH_HID_PROTOCOL_BOOT );
				if( s != USBH_ERR_SUCCESS )
				{
					printf( "HID: SET_PROTOCOL boot failed %02x\n", s );
					return s;
				}
				printf( "HID: boot %s iface #%u, ep=0x%02x maxp=%u interval=%u report=%u\n",
					kind == USBH_HID_KIND_KEYBOARD ? "kbd" : "mouse",
					iface, ep, maxp, interval, rlen );
			}
			else
			{
				printf( "HID: report-proto %s iface #%u, ep=0x%02x maxp=%u interval=%u report=%u\n",
					kind == USBH_HID_KIND_MOUSE    ? "mouse"  :
					kind == USBH_HID_KIND_GAMEPAD  ? "gamepad":
					kind == USBH_HID_KIND_KEYBOARD ? "kbd"    : "?",
					iface, ep, maxp, interval, rlen );
			}
		}
		else
		{
			// Report-protocol HID. Fetch and parse the Report
			// Descriptor. The parser tells us what kind of device
			// it is (mouse with wheel, joystick, gamepad, ...).
			kind = USBH_HID_KIND_GAMEPAD;  // optimistic default;
			                                // overridden below if the
			                                // parser finds a mouse.
			if( dlen == 0 || dlen > USBH_HID_REP_DESC_MAX )
			{
				printf( "HID: bad report desc len %u\n", dlen );
				return USBH_ERR_USB_HID_NOBOOT;
			}
			{
				uint16_t want = dlen;
				s = USBH_GetHidReportDesc( ep0_size, iface,
					rep_desc, &want );
				if( s != USBH_ERR_SUCCESS || want == 0 )
				{
					printf( "HID: GET_REPORT_DESC failed %02x\n", s );
					return s;
				}
				if( pdesc &&
				    parse_report_descriptor( rep_desc, want, pdesc ) )
				{
					if( pdesc->type == USBH_REPORT_TYPE_MOUSE )
						kind = USBH_HID_KIND_MOUSE;
					else if( pdesc->type == USBH_REPORT_TYPE_JOYSTICK )
						kind = USBH_HID_KIND_GAMEPAD;
					else if( pdesc->type == USBH_REPORT_TYPE_KEYBOARD )
						kind = USBH_HID_KIND_KEYBOARD;
					// Otherwise leave the default.
					rlen = pdesc->report_size;
				}
				else
				{
					printf( "HID: report desc unparseable, falling back\n" );
				}
			}
			printf( "HID: report-proto %s iface #%u, ep=0x%02x maxp=%u interval=%u report=%u\n",
				kind == USBH_HID_KIND_MOUSE    ? "mouse"  :
				kind == USBH_HID_KIND_GAMEPAD  ? "gamepad":
				kind == USBH_HID_KIND_KEYBOARD ? "kbd"    : "?",
				iface, ep, maxp, interval, rlen );
		}
	}

