arkadiuszmakarenko/ch32fun/examples_v20x/usbhost_hid/usbhost_hid.c
	*pkind        = kind;
	*prep_len     = rlen;
	*pin_ep       = ep;
	*pin_maxp     = maxp;
	*pin_interval = interval;
	return USBH_ERR_SUCCESS;
}


// ---------------------------------------------------------------------------
// USBH_HidReadReport
//
// One interrupt-IN transfer. Caller passes a buffer that's at least
// `max_len` bytes long; we fill it with up to `max_len` bytes (the
// SIE's full-speed IN FIFO is 64 bytes) and write the actual byte
// count to *pnread. Toggle bookkeeping matches usbhost_xfer.c:
// the SIE has auto-toggle OFF for IN, so the caller flips *ptog
// after a successful TOG_OK reply.
// ---------------------------------------------------------------------------
uint8_t USBH_HidReadReport( uint8_t ep, uint8_t *ptog, uint16_t maxp,
                            void *report, uint8_t max_len,
                            uint8_t *pnread )
{
	uint8_t  rx_len = 0;
	uint8_t  s;

	(void)maxp;

	if( pnread ) *pnread = 0;
	if( max_len == 0 || report == NULL ) return USBH_ERR_USB_UNKNOWN;

	s = USBH_BulkOrIntrIn( ep, *ptog, (uint8_t*)report, &rx_len, 1000 );
	if( s != USBH_ERR_SUCCESS ) return s;

	if( rx_len > max_len ) rx_len = max_len;
	if( pnread ) *pnread = rx_len;
	*ptog ^= 1u;
	return USBH_ERR_SUCCESS;
}


// ---------------------------------------------------------------------------
// USBH_HidDecodeGeneric
//
// Read a raw HID report through the parsed descriptor and produce
// a USBH_HidInputReport. Handles signed axes (a logical_minimum >
// logical_maximum in the descriptor is HID's way of saying "this
// field is signed"; we honor that) and multi-bit buttons (e.g. a
// 16-bit hat switch with logical_min=1, logical_max=8).
// ---------------------------------------------------------------------------
void USBH_HidDecodeGeneric( const hid_report_t *pdesc, uint8_t kind,
                            const uint8_t *raw, uint8_t raw_len,
                            USBH_HidInputReport *out )
{
	if( !out ) return;
	memset( out, 0, sizeof( *out ) );
	if( !pdesc || !raw || raw_len == 0 ) return;

	// Skip the Report ID byte if the descriptor has one. Many
	// devices omit it; some don't.
	uint8_t off = ( pdesc->report_id ) ? 1 : 0;
	if( off >= raw_len ) return;
	const uint8_t *p = raw + off;
	uint8_t plen = (uint8_t)( raw_len - off );

	(void)kind;

	// ---- X / Y axes ----
	for( uint8_t c = 0; c < 2; c++ )
	{
		if( pdesc->axis[c].size == 0 ) continue;
		// HID sign convention: logical_minimum > logical_maximum
		// means "this value is signed".
		int is_signed = ( pdesc->axis[c].logical.min >
		                  pdesc->axis[c].logical.max );
		uint16_t v = collect_bits( p, pdesc->axis[c].offset,
		                           pdesc->axis[c].size, is_signed );
		int16_t sv;
		if( is_signed )
		{
			// Sign-extend manually: collect_bits() returns a
			// uint16_t; convert to int16_t with explicit cast.
			sv = (int16_t)v;
		}
		else
		{
			// Centre on the midpoint, like the reference
			// firmware's usb_mouse.c does. For mice, the axis
			// value is relative and we want a small int8_t-like
			// delta; for joysticks the caller can re-centre.
			uint16_t mn = pdesc->axis[c].logical.min;
			uint16_t mx = pdesc->axis[c].logical.max;
			if( mx <= mn ) continue;
			uint16_t mid = (uint16_t)( ( mn + mx ) / 2u );
			sv = (int16_t)( (int)mid - (int)v );
			// Note: this inverts (toward-top = negative); some
			// callers may prefer the raw value. We leave that
			// to the application.
		}
		if( c == 0 )      out->x = sv;
		else if( c == 1 ) out->y = sv;
		(void)plen;
	}

	// ---- Wheel (mice only) ----
	if( pdesc->wheel.size > 0 )
	{
		int is_signed = ( pdesc->wheel.logical.min >
		                  pdesc->wheel.logical.max );
		uint16_t v = collect_bits( p, pdesc->wheel.offset,
		                           pdesc->wheel.size, is_signed );
		out->wheel = is_signed ? (int16_t)v : (int16_t)( v );
	}

	// ---- Buttons (up to 12 bits) ----
	for( uint8_t b = 0; b < USBH_REPORT_BUTTONS; b++ )
	{
		if( b >= pdesc->button_count ) break;
		// If the parser only filled in button[0..3] because the
		// report had report_count > 4 buttons, fall back to a
		// simple bit-by-bit scan starting at bit_count.
		if( pdesc->button[b].bitmask == 0 &&
		    pdesc->button[b].byte_offset == 0 &&
		    b >= 4 )
		{
			// Synthetic: bit `b` lives at offset
			// (axis[0] + axis[1] + b) in the report. Re-derive
			// from the buttons-count we know.
			// (In practice our parser stores the byte/offset
			// for the first 4 buttons; for b >= 4 we read
			// sequentially from the start of the buttons
			// region.)
			uint16_t btn_bit = (uint16_t)( pdesc->axis[0].size +
			                              pdesc->axis[1].size + b );
			uint8_t  byte = (uint8_t)( btn_bit / 8 );
			uint8_t  bit  = (uint8_t)( btn_bit & 7 );
			if( byte < plen && ( p[byte] & ( 1u << bit ) ) )
			{
				if( b < 8 ) out->buttons       |= (uint8_t)( 1u << b );
				else        out->buttons_extra |= (uint8_t)( 1u << ( b - 8 ) );
			}
			continue;
		}
		if( pdesc->button[b].byte_offset < plen &&
		    ( p[ pdesc->button[b].byte_offset ] & pdesc->button[b].bitmask ) )
		{
			if( b < 8 ) out->buttons       |= (uint8_t)( 1u << b );
			else        out->buttons_extra |= (uint8_t)( 1u << ( b - 8 ) );
		}
	}
}


// ---------------------------------------------------------------------------
// USBH_HidDecodeX360
//
// Xbox 360 wired-controller 20-byte report. Layout (Microsoft public
// protocol): 0x00 0x14 BTN_LO BTN_HI LT RT LX(LE16) LY(LE16) RX(LE16)
// RY(LE16) ... (remainder unused here).
// ---------------------------------------------------------------------------
int USBH_HidDecodeX360( const uint8_t *raw, uint8_t raw_len,
                        USBH_HidX360Report *out )
{
	if( !out ) return -1;
	memset( out, 0, sizeof( *out ) );
	if( !raw || raw_len < 20 ) return -1;
	if( raw[0] != 0x00u || raw[1] != 0x14u ) return -1;

	out->buttons_low  = raw[2];
	out->buttons_high = raw[3];
	out->lt           = raw[4];
	out->rt           = raw[5];
	out->lx = (int16_t)( (uint16_t)raw[6]  | ( (uint16_t)raw[7]  << 8 ) );
	out->ly = (int16_t)( (uint16_t)raw[8]  | ( (uint16_t)raw[9]  << 8 ) );
	out->rx = (int16_t)( (uint16_t)raw[10] | ( (uint16_t)raw[11] << 8 ) );
	out->ry = (int16_t)( (uint16_t)raw[12] | ( (uint16_t)raw[13] << 8 ) );
	return 0;
}


// ---------------------------------------------------------------------------
// USBH_HidKeyToAscii
// ---------------------------------------------------------------------------
uint8_t USBH_HidKeyToAscii( uint8_t usage, uint8_t shift )
{
	if( usage >= 0x04 && usage <= 0x1D )
	{
		// a-z
		uint8_t base = (uint8_t)( 'a' + ( usage - 0x04 ) );
		return shift ? (uint8_t)( base - 'a' + 'A' ) : base;
	}
	if( usage >= 0x1E && usage <= 0x27 )
	{
		// 1-0
		static const char top[10] = "1234567890";
		return (uint8_t)top[ usage - 0x1E ];
	}
	switch( usage )
	{
		case 0x28: return shift ? '<' : '\n';
		case 0x29: return 0;                    // Escape
		case 0x2A: return shift ? '~' : '`';
		case 0x2B: return shift ? '_' : '-';
		case 0x2C: return shift ? '+' : '=';
		case 0x2D: return shift ? '{' : '[';
		case 0x2E: return shift ? '}' : ']';
		case 0x2F: return shift ? '|' : '\\';
		case 0x30: return shift ? '!' : '1';
		case 0x31: return shift ? '@' : '2';
		case 0x32: return shift ? '#' : '3';
		case 0x33: return shift ? '$' : '4';
		case 0x34: return shift ? '%' : '5';
		case 0x35: return shift ? '^' : '6';
		case 0x36: return shift ? '&' : '7';
		case 0x37: return shift ? '*' : '8';
		case 0x38: return shift ? '(' : '9';
		case 0x39: return shift ? ')' : '0';
		case 0x4C: return 0;                    // Delete
		case 0x4F: return 0;                    // Right
		case 0x50: return 0;                    // Left
		case 0x51: return 0;                    // Down
		case 0x52: return 0;                    // Up
	}
	return 0;
}
